---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopType
source: html/016679e8-e33e-f238-6be4-bbfee1c1802b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopType Property

"Top Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentTopType { get; }
```